# TAPS
tap "azure/draft"
tap "buo/cask-upgrade"
tap "cjntaylor/personal"
tap "cockroachdb/tap"
tap "datawire/blackbird"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "microsoft/git"
tap "minio/stable"
tap "txn2/tap"

# BREW
brew "gettext"
brew "gdbm"
brew "libyaml"
brew "ossp-uuid"
brew "readline"
brew "xz"
brew "ansible"
brew "asdf"
brew "giflib"
brew "jpeg"
brew "libpng"
brew "libtiff"
brew "webp"
brew "asciinema"
brew "augeas"
brew "autoconf"
brew "autojump"
brew "automake"
brew "awscli"
brew "azure-cli"
brew "icu4c"
brew "node", link: false
brew "balena-cli"
brew "bash-completion"
brew "bat"
brew "bdw-gc"
brew "benthos"
brew "openjdk"
brew "bfg"
brew "boost"
brew "bpytop"
brew "freetype"
brew "fontconfig"
brew "libffi"
brew "pcre"
brew "glib"
brew "pkg-config"
brew "lzo"
brew "ocaml"
brew "ocamlbuild"
brew "gmp"
brew "coreutils"
brew "libtool"
brew "libidn2"
brew "cask"
brew "dialog"
brew "certbot"
brew "mpfr"
brew "cgal"
brew "cloc"
brew "clojure"
brew "clojurescript"
brew "cmake"
brew "confuse"
brew "cowsay"
brew "cscope"
brew "ctags"
brew "ctop"
brew "dict"
brew "direnv"
brew "docker-squash"
brew "doctl"
brew "unixodbc"
brew "wxwidgets"
brew "erlang"
brew "elixir"
brew "elixir-build"
brew "elm"
brew "elm-format"
brew "exenv"
brew "faas-cli"
brew "libogg"
brew "little-cms2"
brew "mbedtls"
brew "libvorbis"
brew "libsodium"
brew "ffmpeg"
brew "fish"
brew "fluxctl"
brew "fn"
brew "fortune"
brew "fping"
brew "freexl"
brew "libarchive"
brew "fwup"
brew "fx"
brew "fzf"
brew "gd"
brew "geos"
brew "json-c"
brew "libxml2"
brew "libgeotiff"
brew "gdal"
brew "gdb"
brew "gdk-pixbuf"
brew "gforth"
brew "jbig2dec"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "git-flow"
brew "git-lfs"
brew "gitversion"
brew "glew"
brew "glfw"
brew "gnupg"
brew "go"
brew "gradle"
brew "graphviz"
brew "grpcurl"
brew "neko"
brew "haxe"
brew "helm"
brew "lua"
brew "highlight"
brew "htop"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "ios-sim"
brew "ipython"
brew "istioctl"
brew "oniguruma"
brew "jq"
brew "kafka", restart_service: true
brew "kompose"
brew "kotlin"
brew "kubernetes-cli"
brew "kubectx"
brew "leiningen"
brew "libmagic"
brew "libmikmod"
brew "lzlib"
brew "mackup"
brew "mas"
brew "ruby"
brew "macvim"
brew "makedepend"
brew "memtester"
brew "mercurial"
brew "micro"
brew "mikmod"
brew "minio", restart_service: true
brew "minio-mc"
brew "protobuf"
brew "mosh"
brew "neo4j", restart_service: true
brew "nginx", restart_service: true
brew "nmap"
brew "nsq", restart_service: true
brew "openssh"
brew "p7zip"
brew "packer"
brew "packer-completion"
brew "peco"
brew "pgcli"
brew "pipenv"
brew "plantuml"
brew "podofo"
brew "portmidi"
brew "postgresql", restart_service: true
brew "postgresql@13", restart_service: true
brew "prestodb", restart_service: true
brew "pv"
brew "pyenv"
brew "pypy"
brew "rabbitmq", restart_service: true
brew "rakudo-star"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "rust"
brew "rustc-completion"
brew "rustup-init"
brew "scala"
brew "scc"
brew "scons"
brew "screen"
brew "sloccount"
brew "smartmontools"
brew "sphinx-doc"
brew "squashfs"
brew "starship"
brew "syncthing"
brew "tcpkali"
brew "terraform"
brew "testdisk"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "typedb"
brew "vagrant-completion"
brew "vault", restart_service: true
brew "vegeta"
brew "whalebrew"
brew "watch"
brew "watchman", link: false
brew "wget"
brew "yara"
brew "yarn"
brew "youtube-dl"
brew "zig"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "azure/draft/draft"
brew "cockroachdb/tap/cockroach"
brew "minio/stable/mc", link: false
brew "txn2/tap/kubefwd"

# CASK
cask "1password"
cask "anaconda"
cask "android-studio"
cask "audacity"
cask "azure-data-studio"
cask "backblaze"
cask "balenaetcher"
cask "bbedit"
cask "bluejeans"
cask "brackets"
cask "calibre"
cask "capto"
cask "carbon-copy-cloner"
cask "chromedriver"
cask "cloudapp"
cask "dbeaver-community"
cask "dotnet-sdk"
cask "dropbox"
cask "factor"
cask "firefox"
cask "flutter"
cask "gimp"
cask "github"
cask "godot"
cask "google-chat"
cask "google-cloud-sdk"
cask "google-chrome"
cask "google-drive"
cask "google-earth-pro"
cask "hammerspoon"
cask "http-toolkit"
cask "inkscape"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "java"
cask "lens"
cask "libre"
cask "marta"
cask "microsoft-azure-storage-explorer"
cask "microsoft-edge"
cask "microsoft-teams"
cask "micro-snitch"
cask "minikube"
cask "mockoon"
cask "mucommander"
cask "muzzle"
cask "next"
cask "ngrok"
cask "osxfuse"
cask "pgadmin4"
cask "phantomjs"
cask "pharo-launcher"
cask "plex"
cask "postman"
cask "powershell"
cask "pritunl"
cask "pycharm-ce"
cask "scratch"
cask "skype"
cask "skype-for-business"
cask "slack"
cask "squeak"
cask "textexpander"
cask "textmate"
cask "ultimaker-cura"
cask "utm"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
cask "zotero"

# MAS
mas "Xcode", id: 497799835
#mas "Magnet", id: 441258766
mas "The Unarchiver", id: 425424353
mas "Paste - Clipboard Manager", id: 967805235
